package task6_5_1;

public class Task6_5_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 6. Основные структуры данных. Задание №4:\s
                    5. Возьмите любую цитату, запишите её в файл и попробуйте прочитать её посчитав
                       количество уникальных слов в тексте.\s

                Решение:\s""");

    }
}