package task8_2_1;

public class Task8_2_1 {
    public static void main(String[] args) throws InterruptedException {
        System.out.println("""
                Задание:\s
                Модуль 8. Многопоточность. Задание №2:\s
                    1. Напишите программу, которая сможет в одном потоке читать данные из консоли, а в другом потоке
                       будет их выводить.\s

                Решение:\s""");

    }
}
