package task4_12_1;

public class Task4_12_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 4. Наследование. Задание №12:\s
                    1. Зачем переопределять методы при наследовании?\s

                Решение:\s""");

        System.out.println("""
                Переопределение методов при наследовании в языке программирования Java позволяет
                изменить поведение метода в классе-потомке без изменения самого метода в классе-родителе.
                Это позволяет добавить дополнительную функциональность к методу или точечно изменить его
                поведение для конкретного класса, сохранив при этом иерархию классов и их отношения.
                Переопределение методов позволяет также полиморфическое использование методов,
                когда вызов метода будет разрешен в соответствии с типом объекта на момент выполнения
                программы.\s""");
    }
}