package task5_6_0_VideoUrok;

public class Task5_6_0_VideoUrok {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №6:\s
                    1. куда можно добавить модификатор доступа?\s

                Решение:\s""");

    }
}