package task4_10_1_Videourok;

public class Task4_10_1_Videourok {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 4. Наследование. Задание №10:\s
                    1. Выбросите NPE\s

                Решение:\s""");

    }
}
