package task9_1_1;

public class Task9_1_1 {
    public static void main(String[] args) throws InterruptedException {
        System.out.println("""
                Задание:\s
                Модуль 9. UI и использование готовых SDK. Задание №1:\s
                    1. Опишите своими словами что такое Maven?

                Решение:\s""");

    }
}