package task9_1_1;

public class Task9_1_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 9. UI и использование готовых SDK. Задание №1:\s
                    1. Опишите своими словами что такое Maven?

                Решение:\s""");

        System.out.println("""
                Maven - это инструмент управления проектами в языке программирования Java. Он предоставляет стандартную
                структуру проекта, автоматизирует процесс сборки, тестирования и развертывания приложения. Maven
                управляет зависимостями, позволяя легко добавлять библиотеки и внешние компоненты в проект. Кроме того,
                Maven поддерживает конфигурацию проекта через файлы POM (Project Object Model), которые описывают
                структуру проекта, зависимости, плагины и другие параметры. Этот подход делает процесс разработки
                более структурированным и удобным для разработчиков, позволяя им сосредоточиться на написании кода,
                а не на настройке среды разработки.\s""");
    }
}