package task6_7_1;

public class Task6_7_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 6. Основные структуры данных. Задание №7:\s
                    1. Вам необходимо используя HushMap написать базу данных студентов, реализовать
                       бесконечный цикл, пользователь вводит имя студента и оценку и в случае если
                       студент уже внесен в данную базу данных, вводимая оценка должна сохраняться в
                       списке и после каждого ввода необходимо осуществлять вывод на экран средней
                       оценки всех студентов.\s

                Решение:\s""");

        System.out.println("""
                Some text.\s
                """);


    }
}

//class Student {
//    String name;
//    int grade;
//}