package a_shablony;

import java.util.Scanner;

public class Krestiki_Noliki_prostoi {
    public static void main(String[] args) {
        System.out.println("""
            Задание:\s
            Модуль 3. Основы ООП. Задание №10:\s
                1. Напишите сами крестики-нолики, не подглядывая в наш код.\s

            Решение:\s""");

    }
}
