package task5_2_7;

import java.io.IOException;

public class Task5_2_7 {
    public static void main(String[] args) throws IOException {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №2:\s
                    7. Сделайте метод toString у класса ITunesSong, который возвращает информацию
                       в формате JSON\s

                Решение:\s""");

    }
}



