package task9_1_3;

public class Task9_1_3 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 9. UI и использование готовых SDK. Задание №1:\s
                    3. При помощи Maven создайте свой первый проект. В нем создайте класс Task9_1_3 и напишите программу
                       которая будет выводить сообщение “Это мой первый проект Maven!”

                Решение:\s""");


        System.out.println("Это мой первый проект Maven!");
    }
}
