package task7_4_1;

public class Task7_4_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 7. Взаимодействие с API. Задание №4:\s
                    1. Попробуйте создать поток рандомных чисел от -10  до 10,
                       отфильтруйте их так, чтобы остались только положительные, отсортируйте по возрастанию
                       и выведите их  в консоль.\s

                Решение:\s""");

    }
}