package task8_1_1;

public class Task7_5_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 8. Многопоточность. Задание №1:\s
                    1. Создать класс NewThread расширяющий Thread.\s

                Решение:\s""");

    }
}