package task5_2_1;

public class Task5_2_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №2:\s
                    1. У класса FileInformation из предыдущих уроков сделайте метод toString, возвращающий
                       информацию по всем полям.\s

                Решение:\s""");

    }
}