package task9_2_1;

public class Task9_2_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 9. UI и использование готовых SDK. Задание №2:\s
                    1. В данном модуле вам предстоит разработать телеграм бота, а именно  в данном задании нужно
                       создать Maven проект и добавить зависимость  api telegram bots и telegram bots meta\s

                Решение:\s""");

        System.out.println("**********************");
    }
}
