package task6_1_1;

public class Task6_1_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 6. Основные структуры данных. Задание №1:\s
                    1. Что такое компаратор?\s

                Решение:\s""");

        System.out.println("""
                Some text.\s""");
    }
}