package task5_6_2;

public class Task5_6_2 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №6:\s
                    2. где доступны protected-поля?\s

                Решение:\s""");

        System.out.println("""
                protected: Этот модификатор делает члены класса доступными только для классов в том
                же пакете и для подклассов (даже если они находятся в других пакетах).\s""");
    }
}