package task6_6_0_VideoUrok;

public class Task6_6_0_VideoUrok {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 6. Основные структуры данных. Задание №5:\s
                    1. Вам нужно реализовать класс, создать сет студентов и попробуйте его поместить
                       в TreeSet.\s

                Решение:\s""");

        System.out.println("""
                Some text.\s
                """);


    }
}

//class Student {
//    String name;
//    int grade;
//}