package task5_3_8;

import java.io.IOException;

public class Task5_3_8 {
    public static void main(String[] args) throws IOException {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №3:\s
                    8. Доработайте медиабраузер iTunes: он будет сохранять все найденные результаты в массив,
                       далее давай пользователю возможность поискать еще раз; но скрывая повторяющиеся
                       результаты (сверяясь с массивом)\s

                Решение:\s""");

    }
}