package task5_6_5;

public class Task5_6_5 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №6:\s
                    5. где доступны public-методы?\s

                Решение:\s""");

        System.out.println("""
                public: Этот модификатор делает члены класса доступными из любого другого класса
                внутри той же программы или из других программ.\s""");
    }
}