package task5_3_7;

import java.io.IOException;

public class Task5_3_7 {
    public static void main(String[] args) throws IOException {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №3:\s
                    7. Реализуйте метод equals для класса ITunesProduct.\s

                Решение:\s""");

    }
}