package task6_1_3;

public class Task6_1_3 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 6. Основные структуры данных. Задание №1:\s
                    3. Изучите исходники ArrayList.\s

                Решение:\s""");

        System.out.println("""
                В контексте языка программирования Java исходники ArrayList относятся к исходному коду
                класса ArrayList, который является частью стандартной библиотеки Java (java.util).
                ArrayList представляет собой динамический массив, который может изменять свой размер
                по мере необходимости.
                                
                Исходный код ArrayList доступен в виде открытого (open-source) компонента в
                исходных файлах JDK (Java Development Kit). Обычно вы можете найти его на вашем
                компьютере, где установлен JDK, в папке src.zip или в репозитории OpenJDK на GitHub.
                                
                Исходный код ArrayList содержит реализацию методов для добавления, удаления,
                доступа к элементам и других операций, которые можно выполнять с этим списком.
                Он предоставляет гибкий и эффективный способ работы со списками в Java.
                                
                Использование ArrayList в Java обеспечивает удобство при работе с коллекциями,
                так как он позволяет добавлять, удалять и получать элементы из списка, а также
                выполнять другие операции быстро и эффективно.\s""");
    }
}