package task5_2_6;

import java.io.IOException;

public class Task5_2_6 {
    public static void main(String[] args) throws IOException {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №2:\s
                    6. Сделайте метод toString у класса ITunesSong, который возвращает информацию в
                       формате xml: <artist>Rick Ross</artist>… и так далее\s

                Решение:\s""");

    }
}



