package task4_7_7;

public class Task4_7_7 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 4. Наследование. Задание №7:\s
                    7. Доработайте скачивальщик снимков NASA, чтобы в нем не было ни одного throws
                       (пройдитесь прям поиском по файлу). Throws придётся заменить на try catch.\s

                Решение:\s""");

    }
}
