package task6_3_1;

public class Task6_3_1 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 6. Основные структуры данных. Задание №3:\s
                    1. Нужно отсортировать случайный список чисел.
                       Числа нужно отсортировать следующим образом:
                       Четные идут в начале по возрастанию, нечетные по убыванию в конце списка.\s

                Решение:\s""");

        System.out.println("""
                Some text""");

    }
}