package task9_1_2;

public class Task9_1_2 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 9. UI и использование готовых SDK. Задание №1:\s
                    2. Опишите своими словами что такое Gradle?

                Решение:\s""");

        System.out.println("""
                Gradle - это инструмент автоматизации сборки проектов, который используется в языке программирования
                Java. Он предоставляет гибкую систему управления зависимостями, сборкой и развертыванием приложений.
                Gradle позволяет описывать структуру проекта и его зависимости с помощью DSL (Domain-Specific Language),
                что делает конфигурацию более удобной и понятной. Он поддерживает множество плагинов и интегрируется
                с различными инструментами разработки. Одним из ключевых преимуществ Gradle является его высокая
                производительность благодаря эффективному механизму инкрементальной сборки, что позволяет быстрее
                компилировать и собирать проекты.\s""");
    }
}