package task5_5_0_Videourok;

import java.io.IOException;

public class Task5_5_0_Videourok {
    public static void main(String[] args) throws IOException {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №5:\s
                    1. Создайте абстрактный класс SongLyrics, который возвращает текст песни по названию.\s

                Решение:\s""");

        System.out.println("""
                Some text.\s""");
    }
}