package task5_6_3;

public class Task5_6_3 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №6:\s
                    3. где доступны private-методы?\s

                Решение:\s""");

        System.out.println("""
                private: Этот модификатор делает члены класса доступными только внутри того же
                класса. Они недоступны даже для подклассов этого класса.\s""");
    }
}