package task5_3_9;

import java.io.IOException;

public class Task5_3_9 {
    public static void main(String[] args) throws IOException {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №3:\s
                    9. Реализуйте метод equals для класса NasaPictureInfo. Как сделать его максимально просто?\s

                Решение:\s""");

    }
}