package task5_6_0_VideoUrok;

// public - максимальный доступ
// 1. другой метод того же самого класса
// 2. другой класс в том же пакете
// 3. наследник этого класса
// 4. другой класс в ДРУГОМ пакете

// protected
// 1. другой метод того же самого класса
// 2. другой класс в том же пакете
// 3. наследник этого класса

// отсутствие модификатора доступа или default (package-private)
// 1. другой метод того же самого класса
// 2. другой класс в том же пакете

// private
// 1. другой метод того же самого класса

public class Task5_6_0_VideoUrok {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №6:\s
                    1. куда можно добавить модификатор доступа?\s

                Решение:\s""");

    }
}