package mytask9_1_3;

public class Task9_1_3 {
    public static void main(String[] args) {
        System.out.println("""
                Задание:\s
                Модуль 9. UI и использование готовых SDK. Задание №1:\s
                    3. При помощи Maven создайте свой первый проект в нем создайте класс Main  и напишите программу
                       которая будет выводить сообщение “Это мой первый проект Maven!”

                Решение:\s""");


        System.out.println("Это мой первый проект Maven!");
    }
}




//// ПРИМЕР 2
//Был файл pom.xml
//<?xml version="1.0" encoding="UTF-8"?>
//<project xmlns="http://maven.apache.org/POM/4.0.0"
//xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
//xsi:schemaLocation="http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd">
//    <modelVersion>4.0.0</modelVersion>
//
//    <groupId>mytask9_1_3</groupId>
//    <artifactId>Draft240101_Maven-task9_1_3</artifactId>
//    <version>1.0-SNAPSHOT</version>
//
//    <dependencies>
//        <!-- Здесь вы можете добавить зависимости, если они вам нужны -->
//    </dependencies>
//
//    <build>
//        <sourceDirectory>src/task9_1_3/main/java</sourceDirectory>
//        <plugins>
//            <plugin>
//                <groupId>org.apache.maven.plugins</groupId>
//                <artifactId>maven-compiler-plugin</artifactId>
//                <configuration>
//                    <source>15</source>
//                    <target>15</target>
//                </configuration>
//            </plugin>
//        </plugins>
//    </build>
//</project>
//// КОНЕЦ ПРИМЕРА 2
