package task5_4_0_Videourok;

import java.io.IOException;

public class Task5_4_0_Videourok {
    public static void main(String[] args) throws IOException {
        System.out.println("""
                Задание:\s
                Модуль 5. Интерфейсы, абстрактные классы, статические методы. Задание №4:\s
                    1. Зачем могут пригодиться default-методы в интерфейсах?\s

                Решение:\s""");

        System.out.println("""
                \nSome text.\s""");
    }
}